In [1]:
#importing libraries
import numpy as np
import pandas as pd

In [2]:
#reading train data
customer_train_raw_data=pd.read_csv("C:/Users/kallol/Downloads/retail_trainingset.csv")

In [3]:
#reading test data
customer_test_raw_data=pd.read_csv("C:/Users/kallol/Downloads/retail_testset.csv")

In [4]:
#first five rows of the train data to know the structure of the train data
customer_test_raw_data.head()

,ID,Gender,Region,Channel,DOB,Card_registration_date,Last_visit,Amt_spent_in_last_year,Total_amt_spent,Total_visits
0,1,Female,B,Online,1970/10/01,2010/10/07,2014/03/02,1594,18202,7
1,2,Female,A,Both,1980/07/16,2010/06/18,2014/11/24,1639,13000,20
2,3,Female,A,Offline,1966/10/20,2008/03/10,2014/10/12,1840,18424,20
3,4,Male,A,Both,1967/10/15,2008/05/10,2014/06/03,1859,21178,9
4,5,Male,A,Offline,1983/10/12,2011/12/06,2014/10/04,1609,19471,20

In [5]:
#same goes for test data
customer_train_raw_data.head()

,Gender,Region,Channel,DOB,Card_registration_date,Last_visit,Amt_spent_in_last_year,Total_amt_spent,Total_visits,Churn
0,Male,A,Both,1967/08/19,2009/01/21,2014/01/18,1187,19258,20,No
1,Female,B,Online,1988/04/25,2010/01/27,2014/04/09,1693,14900,20,No
2,Male,B,Both,1966/04/21,2008/11/08,2014/01/27,1366,17410,20,No
3,Male,A,Both,1981/01/08,2011/11/28,2014/05/11,1622,18578,12,No
4,Male,A,Both,1972/10/22,2011/06/13,2015/01/31,1357,19187,20,No

In [6]:
#importing library to know the count of unique value
from collections import Counter

In [7]:
Counter(customer_train_raw_data.Churn)

Counter({'No': 26993, 'Yes': 3007})

In [8]:
#counting the values of each column
customer_train_raw_data.count()

Gender                    30000
Region                    30000
Channel                   30000
DOB                       30000
Card_registration_date    30000
Last_visit                30000
Amt_spent_in_last_year    30000
Total_amt_spent           30000
Total_visits              30000
Churn                     30000
dtype: int64

In [9]:
#data is imbalanced. So we need to under sample it to reduce bias
#creating two dataframes for two classes

for i in range(0,30000):
    if(customer_train_raw_data.iloc[i,9]=='Yes'):
        customer_train_raw_data.iloc[i,9]=1
    else:
        customer_train_raw_data.iloc[i,9]=0

In [10]:
Counter(customer_train_raw_data.Churn)

Counter({0: 26993, 1: 3007})

In [11]:
#customer_train_raw_data['Churn']=customer_train_raw_data['Churn'].astype(object)

In [12]:
customer_train_raw_data.head()

,Gender,Region,Channel,DOB,Card_registration_date,Last_visit,Amt_spent_in_last_year,Total_amt_spent,Total_visits,Churn
0,Male,A,Both,1967/08/19,2009/01/21,2014/01/18,1187,19258,20,0
1,Female,B,Online,1988/04/25,2010/01/27,2014/04/09,1693,14900,20,0
2,Male,B,Both,1966/04/21,2008/11/08,2014/01/27,1366,17410,20,0
3,Male,A,Both,1981/01/08,2011/11/28,2014/05/11,1622,18578,12,0
4,Male,A,Both,1972/10/22,2011/06/13,2015/01/31,1357,19187,20,0

In [13]:
#storing data for backup
retail_train_data=customer_train_raw_data

In [14]:
#storing data for back up
retail_test_data=customer_test_raw_data

In [15]:
#assigning dummy variables for gender i.e. categorical variable
retail_train_data.Gender=pd.get_dummies(retail_train_data.Gender)

In [16]:
#same for test data
retail_test_data.Gender=pd.get_dummies(retail_test_data.Gender)

In [17]:
Counter(retail_train_data.Channel)

Counter({'Both': 15086, 'Offline': 3774, 'Online': 11140})

In [18]:
retail_train_data.Channel=pd.get_dummies(retail_train_data.Channel)

In [19]:
retail_test_data.Channel=pd.get_dummies(retail_test_data.Channel)

In [20]:
retail_train_data.head()

,Gender,Region,Channel,DOB,Card_registration_date,Last_visit,Amt_spent_in_last_year,Total_amt_spent,Total_visits,Churn
0,0,A,1,1967/08/19,2009/01/21,2014/01/18,1187,19258,20,0
1,1,B,0,1988/04/25,2010/01/27,2014/04/09,1693,14900,20,0
2,0,B,1,1966/04/21,2008/11/08,2014/01/27,1366,17410,20,0
3,0,A,1,1981/01/08,2011/11/28,2014/05/11,1622,18578,12,0
4,0,A,1,1972/10/22,2011/06/13,2015/01/31,1357,19187,20,0

In [21]:
#dummies
retail_train_data.Region=pd.get_dummies(retail_train_data.Region)

In [22]:
retail_test_data.Region=pd.get_dummies(retail_test_data.Region)

In [23]:
retail_train_data.tail()

,Gender,Region,Channel,DOB,Card_registration_date,Last_visit,Amt_spent_in_last_year,Total_amt_spent,Total_visits,Churn
29995,0,1,0,1970/11/23,2011/07/10,2014/12/17,1666,26505,20,0
29996,1,1,0,1980/01/03,2008/08/16,2014/10/09,1508,21039,18,0
29997,1,0,0,1988/05/31,2008/01/07,2014/03/12,1633,18432,20,1
29998,0,0,1,1986/06/06,2008/04/03,2014/01/19,1409,15393,12,0
29999,1,0,1,1979/02/01,2010/04/17,2014/09/08,1435,16748,8,0

In [24]:
from datetime import datetime

In [25]:
#creating an empty column called duration
retail_train_data['duration'] = np.nan

In [26]:
retail_train_data.head()

,Gender,Region,Channel,DOB,Card_registration_date,Last_visit,Amt_spent_in_last_year,Total_amt_spent,Total_visits,Churn,duration
0,0,1,1,1967/08/19,2009/01/21,2014/01/18,1187,19258,20,0,NaN
1,1,0,0,1988/04/25,2010/01/27,2014/04/09,1693,14900,20,0,NaN
2,0,0,1,1966/04/21,2008/11/08,2014/01/27,1366,17410,20,0,NaN
3,0,1,1,1981/01/08,2011/11/28,2014/05/11,1622,18578,12,0,NaN
4,0,1,1,1972/10/22,2011/06/13,2015/01/31,1357,19187,20,0,NaN

In [27]:
#duration is the no. of days the customer acted as a customer
#duration is found by substracting the card registration date from the last visit date
date_format = "%Y/%m/%d"
for i in range(0,30000):
    a = datetime.strptime(retail_train_data.iloc[i,4], date_format)
    b = datetime.strptime(retail_train_data.iloc[i,5], date_format)
    delta=b-a
    retail_train_data.iloc[i,10]=delta.days

In [28]:
retail_test_data['duration'] = np.nan

In [29]:
#same thing doing for test data set
date_format = "%Y/%m/%d"
for i in range(0,20000):
    a = datetime.strptime(retail_test_data.iloc[i,5], date_format)
    b = datetime.strptime(retail_test_data.iloc[i,6], date_format)
    delta=b-a
    retail_test_data.iloc[i,10]=delta.days

In [30]:
#creating an empty column as age
retail_train_data['age'] = np.nan

In [31]:
retail_train_data.head()

,Gender,Region,Channel,DOB,Card_registration_date,Last_visit,Amt_spent_in_last_year,Total_amt_spent,Total_visits,Churn,duration,age
0,0,1,1,1967/08/19,2009/01/21,2014/01/18,1187,19258,20,0,1823.0,NaN
1,1,0,0,1988/04/25,2010/01/27,2014/04/09,1693,14900,20,0,1533.0,NaN
2,0,0,1,1966/04/21,2008/11/08,2014/01/27,1366,17410,20,0,1906.0,NaN
3,0,1,1,1981/01/08,2011/11/28,2014/05/11,1622,18578,12,0,895.0,NaN
4,0,1,1,1972/10/22,2011/06/13,2015/01/31,1357,19187,20,0,1328.0,NaN

In [32]:
#the age can be found by substracting date of birth frim the current date
date_format = "%Y/%m/%d"
for i in range(0,30000):
    a = datetime.strptime(retail_train_data.iloc[i,3], date_format)
    b = datetime.strptime('2017/12/17', date_format)
    delta=b-a
    retail_train_data.iloc[i,11]=delta.days

In [33]:
retail_test_data['age'] = np.nan

In [34]:
retail_train_data.head()

,Gender,Region,Channel,DOB,Card_registration_date,Last_visit,Amt_spent_in_last_year,Total_amt_spent,Total_visits,Churn,duration,age
0,0,1,1,1967/08/19,2009/01/21,2014/01/18,1187,19258,20,0,1823.0,18383.0
1,1,0,0,1988/04/25,2010/01/27,2014/04/09,1693,14900,20,0,1533.0,10828.0
2,0,0,1,1966/04/21,2008/11/08,2014/01/27,1366,17410,20,0,1906.0,18868.0
3,0,1,1,1981/01/08,2011/11/28,2014/05/11,1622,18578,12,0,895.0,13492.0
4,0,1,1,1972/10/22,2011/06/13,2015/01/31,1357,19187,20,0,1328.0,16492.0

In [35]:
#same goes for test set
date_format = "%Y/%m/%d"
for i in range(0,20000):
    a = datetime.strptime(retail_test_data.iloc[i,4], date_format)
    b = datetime.strptime('2017/12/17', date_format)
    delta=b-a
    retail_test_data.iloc[i,11]=delta.days

In [36]:
retail_test_data.head()

,ID,Gender,Region,Channel,DOB,Card_registration_date,Last_visit,Amt_spent_in_last_year,Total_amt_spent,Total_visits,duration,age
0,1,1,0,0,1970/10/01,2010/10/07,2014/03/02,1594,18202,7,1242.0,17244.0
1,2,1,1,1,1980/07/16,2010/06/18,2014/11/24,1639,13000,20,1620.0,13668.0
2,3,1,1,0,1966/10/20,2008/03/10,2014/10/12,1840,18424,20,2407.0,18686.0
3,4,0,1,1,1967/10/15,2008/05/10,2014/06/03,1859,21178,9,2215.0,18326.0
4,5,0,1,0,1983/10/12,2011/12/06,2014/10/04,1609,19471,20,1033.0,12485.0

In [37]:
#now DOB, card registration date and Last visit date are not required, So deleting them
train_data=retail_train_data.drop('DOB',1)

In [38]:
train_data=train_data.drop('Card_registration_date',1)

In [39]:
train_data=train_data.drop('Last_visit',1)

In [40]:
train_data.head()

,Gender,Region,Channel,Amt_spent_in_last_year,Total_amt_spent,Total_visits,Churn,duration,age
0,0,1,1,1187,19258,20,0,1823.0,18383.0
1,1,0,0,1693,14900,20,0,1533.0,10828.0
2,0,0,1,1366,17410,20,0,1906.0,18868.0
3,0,1,1,1622,18578,12,0,895.0,13492.0
4,0,1,1,1357,19187,20,0,1328.0,16492.0

In [41]:
#same thing for test data
retail_test_data=retail_test_data.drop('DOB',1)

In [42]:
retail_test_data=retail_test_data.drop('ID',1)

In [43]:
retail_test_data=retail_test_data.drop('Card_registration_date',1)

In [44]:
retail_test_data=retail_test_data.drop('Last_visit',1)

In [45]:
retail_test_data.head()

,Gender,Region,Channel,Amt_spent_in_last_year,Total_amt_spent,Total_visits,duration,age
0,1,0,0,1594,18202,7,1242.0,17244.0
1,1,1,1,1639,13000,20,1620.0,13668.0
2,1,1,0,1840,18424,20,2407.0,18686.0
3,0,1,1,1859,21178,9,2215.0,18326.0
4,0,1,0,1609,19471,20,1033.0,12485.0

In [46]:
train_data.head()

,Gender,Region,Channel,Amt_spent_in_last_year,Total_amt_spent,Total_visits,Churn,duration,age
0,0,1,1,1187,19258,20,0,1823.0,18383.0
1,1,0,0,1693,14900,20,0,1533.0,10828.0
2,0,0,1,1366,17410,20,0,1906.0,18868.0
3,0,1,1,1622,18578,12,0,895.0,13492.0
4,0,1,1,1357,19187,20,0,1328.0,16492.0

In [47]:
#importing libraries for data normalization
from sklearn import preprocessing

In [48]:
#importing libraries for splitting the datset into train and test
from sklearn.model_selection import train_test_split

In [49]:
train_data.head()

,Gender,Region,Channel,Amt_spent_in_last_year,Total_amt_spent,Total_visits,Churn,duration,age
0,0,1,1,1187,19258,20,0,1823.0,18383.0
1,1,0,0,1693,14900,20,0,1533.0,10828.0
2,0,0,1,1366,17410,20,0,1906.0,18868.0
3,0,1,1,1622,18578,12,0,895.0,13492.0
4,0,1,1,1357,19187,20,0,1328.0,16492.0

In [50]:
#splitting the data
xtrain,ytrain,xtest,ytest=train_test_split(train_data.iloc[:,[0,1,2,3,4,5,7,8]],train_data['Churn'],test_size=0.3)

In [51]:
xtrain.head()

,Gender,Region,Channel,Amt_spent_in_last_year,Total_amt_spent,Total_visits,duration,age
28320,1,1,1,1419,18421,15,1288.0,18700.0
15422,1,1,0,1534,13797,12,1639.0,15336.0
1895,1,1,1,1581,7585,20,1280.0,13943.0
13337,0,0,0,1602,20475,8,1288.0,17540.0
12961,1,1,0,1362,17946,7,1076.0,13337.0

In [52]:
xtest.head()

28320    0
15422    0
1895     0
13337    0
12961    0
Name: Churn, dtype: object

In [53]:
xtrain.count()

Gender                    21000
Region                    21000
Channel                   21000
Amt_spent_in_last_year    21000
Total_amt_spent           21000
Total_visits              21000
duration                  21000
age                       21000
dtype: int64

In [54]:
xtest.count()

21000

In [55]:
Counter(xtest)

Counter({0: 18905, 1: 2095})

In [56]:
#storing xtrain for backup
newdata=xtrain

In [57]:
#adding a new column as churn and storing the xtest value
newdata['churn']=xtest

In [58]:
newdata.tail()

,Gender,Region,Channel,Amt_spent_in_last_year,Total_amt_spent,Total_visits,duration,age,churn
14105,1,0,0,1426,19468,12,1149.0,16597.0,0
818,0,1,0,1749,19079,20,2017.0,12267.0,1
6560,0,0,0,1695,26921,10,1227.0,14280.0,0
25361,0,1,0,1264,16110,8,1524.0,16791.0,0
6334,0,1,1,1180,15193,20,1525.0,20059.0,0

In [59]:
#creating a dataframe with all churn values one
churn1=train_data[train_data.Churn==1]

In [60]:
#creating dataframe with all values zero, that is required for cross validation
churn=train_data[train_data.Churn==0]

In [61]:
churn1.count()

Gender                    3007
Region                    3007
Channel                   3007
Amt_spent_in_last_year    3007
Total_amt_spent           3007
Total_visits              3007
Churn                     3007
duration                  3007
age                       3007
dtype: int64

In [62]:
#taking 4000 rows randomly where the churn is zero(undersampling)
churn0=churn.sample(n=3007)

In [63]:
#adding two data frames(one with all zeros and another with ones)
small_data=churn1.append(churn0)

In [64]:
#changing the indexes
small_data=small_data.sample(frac=1).reset_index(drop=True)

In [65]:
#the independent variables
smallTrain=small_data.iloc[:,[0,1,2,3,4,5,7,8]]

In [66]:
#dependent variable
smallTest=small_data.iloc[:,6]

In [67]:
Counter(xtest)

Counter({0: 18905, 1: 2095})

In [68]:
smallTrain.dtypes

Gender                      uint8
Region                      uint8
Channel                     uint8
Amt_spent_in_last_year      int64
Total_amt_spent             int64
Total_visits                int64
duration                  float64
age                       float64
dtype: object

In [69]:
smallTrain.head()

,Gender,Region,Channel,Amt_spent_in_last_year,Total_amt_spent,Total_visits,duration,age
0,1,1,1,1357,24941,20,2318.0,12921.0
1,0,0,0,1562,14407,12,1026.0,18038.0
2,1,1,1,1768,18036,10,2312.0,10251.0
3,0,0,1,1280,18229,20,1166.0,15259.0
4,1,1,0,1741,14871,20,2035.0,13673.0

In [70]:
smallTest.head()

0    1
1    1
2    0
3    0
4    1
Name: Churn, dtype: object

In [71]:
#calling decision tree classifier
from sklearn import tree

In [72]:
#creating decision tree model
decissionTree=tree.DecisionTreeClassifier()

In [73]:
#changing all variables of the dataframe into integer
smallTest=smallTest.astype(int)

In [74]:
#fitting the model
treeModel=decissionTree.fit(smallTrain,smallTest.astype(int))

In [75]:
#decision tree predicted output(for cross validation)
predTree=treeModel.predict(ytrain)

In [76]:
#calling to check the accuracy
from sklearn import metrics

In [77]:
ytest=ytest.astype(int)

In [78]:
predTree

array([0, 1, 1, ..., 0, 1, 0])

In [79]:
#accuracy score
metrics.accuracy_score(predTree,ytest)

0.61077777777777775

In [80]:
#metrics.cohen_kappa_score(predTree,ytest)

In [81]:
#metrics.roc_auc_score(predTree,ytest)

In [82]:
#decision tree probability output
#predictPROBA=treeModel.predict_proba(ytrain)

In [83]:
#predictPROBA

In [84]:
#calling for logistic regression
from sklearn import linear_model

In [85]:
#model creation
logistic=linear_model.LogisticRegression()

In [86]:
#fitting the data into logistic model
model_Logistic=logistic.fit(smallTrain,smallTest.astype(int))

In [87]:
predictLogistic=model_Logistic.predict(ytrain)

In [88]:
metrics.accuracy_score(predictLogistic,ytest)

0.499

In [89]:
#logistic model probability data
model_Logistic.predict_proba(ytrain)

array([[ 0.50572121,  0.49427879],
       [ 0.49377224,  0.50622776],
       [ 0.51747246,  0.48252754],
       ...,
       [ 0.50639694,  0.49360306],
       [ 0.50623242,  0.49376758],
       [ 0.5209401 ,  0.4790599 ]])

In [90]:
#calling for knn algorithm
from sklearn import neighbors

In [91]:
#selecting the value of k in knn(parameter tuning)
for i in range(1,10):
    knn=neighbors.KNeighborsClassifier(n_neighbors=i)
    modelKnn=knn.fit(smallTrain,smallTest.astype(int))
    predKnn=modelKnn.predict(ytrain)
    w= metrics.cohen_kappa_score(predKnn,ytest)
    print i
    print w

1
0.209318810231
2
0.178849526163
3
0.10098723218
4
0.100079080069
5
0.0745717224712
6
0.0812096315878
7
0.0618060793384
8
0.0641599319566
9
0.0438154405317

In [92]:
#k=3 gives best result, so we can siign the k value of 3
knn=neighbors.KNeighborsClassifier(n_neighbors=2)

In [93]:
#fitting into knn model
modelKnn=knn.fit(smallTrain,smallTest.astype(int))

In [94]:
#knn predicted data(cross validation)
predKnn=modelKnn.predict(ytrain)

In [95]:
metrics.accuracy_score(predKnn,ytest)

0.75900000000000001

In [96]:
#metrics.cohen_kappa_score(predKnn,ytest)

In [97]:
#metrics.roc_auc_score(predKnn,ytest)

In [98]:
#knn probability output
modelKnn.predict_proba(ytrain)

array([[ 0. ,  1. ],
       [ 0. ,  1. ],
       [ 0.5,  0.5],
       ...,
       [ 1. ,  0. ],
       [ 1. ,  0. ],
       [ 0.5,  0.5]])

In [99]:
retail_test_data.head()

,Gender,Region,Channel,Amt_spent_in_last_year,Total_amt_spent,Total_visits,duration,age
0,1,0,0,1594,18202,7,1242.0,17244.0
1,1,1,1,1639,13000,20,1620.0,13668.0
2,1,1,0,1840,18424,20,2407.0,18686.0
3,0,1,1,1859,21178,9,2215.0,18326.0
4,0,1,0,1609,19471,20,1033.0,12485.0

In [100]:
smallTrain.head()

,Gender,Region,Channel,Amt_spent_in_last_year,Total_amt_spent,Total_visits,duration,age
0,1,1,1,1357,24941,20,2318.0,12921.0
1,0,0,0,1562,14407,12,1026.0,18038.0
2,1,1,1,1768,18036,10,2312.0,10251.0
3,0,0,1,1280,18229,20,1166.0,15259.0
4,1,1,0,1741,14871,20,2035.0,13673.0

In [101]:
#creating the empty list
result=[]

In [102]:
#converitng list to empty dataframe
result=pd.DataFrame(result)

In [103]:
#predicted probability value of test data
predProb=modelKnn.predict_proba(retail_test_data)

In [104]:
#empty list
y=[]

In [105]:
#assigning the predicted probability knn in the list y
for i in range(0,20000):
    y.append(predProb[i][0])

In [106]:
#predicted probability of decision tree model
predTree=treeModel.predict_proba(retail_test_data)

In [107]:
#predicted probability of logistic regression model
predLogit=model_Logistic.predict_proba(retail_test_data)

In [108]:
#empty list
z=[]

In [109]:
#storing the value of decision tree output
for i in range(0,20000):
    z.append(predTree[i][0])

In [110]:
#predProb[0][0]

In [111]:
#creating the first column of the output dataframe
result['ID']=customer_test_raw_data.ID

In [112]:
#creating second column
#we are taking kn output beacuse it gave the best result
result['Churn']=y

In [113]:
result.head()

   ID  Churn
0   1    0.5
1   2    0.5
2   3    0.5
3   4    0.0
4   5    0.5

In [114]:
#creating the csv file of the output
result.to_csv('sub4.csv')